{
    "@Redfish.Copyright": "Copyright 2019 DMTF. All rights reserved.",
    "@Redfish.License": "Creative Commons Attribution 4.0 License.  For full text see link: https://creativecommons.org/licenses/by/4.0/",
    "@odata.type": "#MessageRegistry.v1_3_1.MessageRegistry",
    "Id": "Composition.1.0.0",
    "Name": "Composition Message Registry",
    "Language": "en",
    "Description": "This registry defines the messages for composition related events",
    "RegistryPrefix": "Composition",
    "RegistryVersion": "1.0.0",
    "OwningEntity": "DMTF",
    "Messages": {
        "ResourceBlockChanged": {
            "Description": "Indicates that a Resource Block has changed.  This is not used whenever there is another event message for that specific change, such as only the state has changed.",
            "LongDescription": "This message shall be used to indicate that one or more properties of a Resource Block have changed.  This message shall not be used for cases where a more specific message could be used in its place.",
            "Message": "The Resource Block '%1' has changed on the service.",
            "Severity": "OK",
            "NumberOfArgs": 1,
            "ParamTypes": [
                "string"
            ],
            "ArgDescriptions": [
                "The Id of the Resource Block that has changed."
            ],
            "ArgLongDescriptions": [
                "The value of this argument shall be a string containing the value of the Id property of the Resource Block that has changed."
            ],
            "Resolution": "Refresh your cached version of the Resource Block to get the updated information from the service."
        },
        "ResourceBlockStateChanged": {
            "Description": "Indicates that the state of a Resource Block has changed, specifically the value of the Status.State property has changed.",
            "LongDescription": "This message shall be used to indicate that the State property within the Status object of a Resource Block has changed.",
            "Message": "The state of the Resource Block '%1' has changed.",
            "Severity": "OK",
            "NumberOfArgs": 1,
            "ParamTypes": [
                "string"
            ],
            "ArgDescriptions": [
                "The Id of the Resource Block that has changed."
            ],
            "ArgLongDescriptions": [
                "The value of this argument shall be a string containing the value of the Id property of the Resource Block that has changed."
            ],
            "Resolution": "Refresh your cached version of the Resource Block to get the updated information from the service."
        },
        "ResourceBlockCompositionStateChanged": {
            "Description": "Indicates that the composition state of a Resource Block has changed, specifically the value of the CompositionStatus.CompositionState property has changed.",
            "LongDescription": "This message shall be used to indicate that the CompositionState property within the CompositionStatus object of a Resource Block has changed.",
            "Message": "The composition status of the Resource Block '%1' has changed.",
            "Severity": "OK",
            "NumberOfArgs": 1,
            "ParamTypes": [
                "string"
            ],
            "ArgDescriptions": [
                "The Id of the Resource Block that has changed."
            ],
            "ArgLongDescriptions": [
                "The value of this argument shall be a string containing the value of the Id property of the Resource Block that has changed."
            ],
            "Resolution": "Refresh your cached version of the Resource Block to get the updated information from the service."
        },
        "ResourceZoneMembershipChanged": {
            "Description": "Indicates that the membership of a Resource Zone has changed due to Resource Blocks being added or removed from the Resource Zone.",
            "LongDescription": "This message shall be used to indicate that entries found in the ResourceBlocks array within the Links object for a Resource Zone have been added or removed.",
            "Message": "The membership of Resource Zone '%1' has been changed.",
            "Severity": "OK",
            "NumberOfArgs": 1,
            "ParamTypes": [
                "string"
            ],
            "ArgDescriptions": [
                "The Id of the Resource Zone that has changed."
            ],
            "ArgLongDescriptions": [
                "The value of this argument shall be a string containing the value of the Id property of the Resource Zone that has changed."
            ],
            "Resolution": "Refresh your cached version of the Resource Zone to get the updated information from the service."
        },
        "ResourceBlockInUse": {
            "Description": "Indicates that the composition request contains a Resource Block that is unable to participate in more compositions.",
            "LongDescription": "This message shall be used to indicate that the composition request contains a Resource Block that is unable to participate in more compositions due to restrictions specified in its CompositionStatus property.  For example, the Resource Block has reached its composition limit specified by the MaxCompositions property.",
            "Message": "The Resource Block with Id '%1' cannot be part of any new compositions.",
            "Severity": "Warning",
            "NumberOfArgs": 1,
            "ParamTypes": [
                "string"
            ],
            "ArgDescriptions": [
                "The Id of the Resource Block that cannot be part of any new compositions."
            ],
            "ArgLongDescriptions": [
                "The value of this argument shall be a string containing the value of the Id property of the Resource Block that cannot be part of any new compositions."
            ],
            "Resolution": "Remove the Resource Block from the request and resubmit the request."
        }
    }
}